[{"title":"Tipe Data Bentukan","date":"2017-06-07T07:09:47.000Z","path":"2017/06/07/tipe-data-bentukan/","text":"Dalam perjalanan pembuatan program, ada kalanya kita memerlukan tipe data baru yang tidak terdefinisikan sebelumnya pada sebuah bahasa pemrograman. Misalkan untuk menyimpan nilai waktu kita memerlukan tiga variabel yang saling terhubung, yaitu tiga variabel dengan tipe data integer untuk meyimpan nilai jam, menit, dan detik. Jika menggunakan cara konvensional yaitu mendeklarasikan tiga variabel secara manual kemudian mengisikan nilainya, maka akan cukup merepotkan. Belum lagi jika data waktu yang perlu kita simpan dan manipulasi lebih dari satu dan perlu disimpan dengan menggunakan array. Deklarasi StrukturSebagai solusi dari permasalahan tersebut, bahasa pemrograman biasanya menyediakan mekanisme khusus untuk membentuk tipe data baru dengan menggabungkan tipe data primitif yang sudah ada. Dalam bahasa pemrograman C, perintah yang digunakan untuk membentuk struktur tipe data baru adalah mengguanakan perintah struct yang diikuti nama tipe data dan komponen-komponen tipe datanya. Berikut adalah contoh pembuatan/deklarasi struktur tipe data time dengan menggunakan perintah struct: 1234567struct time&#123; int jam; int menit; int detik;&#125;struct time var_time; Pada contoh koding di atas, terlihat pada baris 1 - 4 cara deklarasi tipe data time dengan menggunakan perintah struct yang diikuti dengan nama struktur dan komponen tipe datanya. Sedangkan pada baris 6 ditunjukkan cara penggunaan struktur baru yang telah dideklarasikan adalah menggunakan perintah struct yang diikuti nama struktur dan nama variabelnya. Setelah mendeklarasikan struktur serta variabelnya, kita dapat mengakses komponen dari tipe data tersebut dengan menggunakan operator . (titik) setelah nama variabelnya. Contoh pengaksesan komponen pada struktur sebagaimana ditunjukkan pada koding berikut: 123456struct time var_time;var_time.jam = 2;var_time.menit = 40;var_time.detik = 33;printf(\"%d:%d:%d\", var_time.jam, var_time.menit, var_time.detik); Koding pada baris 2 - 4 mengakses komponen jam, menit, dan detik untuk mengisikan nilai pada komponen variabel tersebut, sedangkan pada baris 6 nilai yang telah diisikan diakses untuk dicetak menggunakan perintah printf. Deklarasi variabel struct baru harus selalu menggunakan kata kunci struct untuk menunjukkan bahwa tipe data time adalah tipe data dalam bentuk struktur. Namun kita dapat mengguanakan perintah typedef untuk memberikan alias pada struktur tersebut sehingga kita dapat menggunakannya selayaknya tipe data primitif lain. Contoh penggunaan typdef ditunjukkan pada koding di bawah ini: 1234567struct s_time&#123; int jam; int menit; int detik;&#125; time;time new_time; Fungsi OperatorMembuat struktur tipe data baru saja tidak cukup. Agar tipe data yang telah kita buat dapat digunakan dengan baik, selain mendeklarasikan strukturnya, kita juga harus membuatkan fungsi-fungsi untuk mengoperasikan tipe data tersebut. Berdasarkan kategori penggunaannya, ada empat jenis fungsi operator yang biasanya dibuat setiap membuat tipe data baru yaitu: Fungsi konstruktor: fungsi yang digunakan untuk membentuk tipe data baru Fungsi selector: fungsi yang digunakan untuk mendapatkan nilai komponen atau nilai tertentu dari tipe data baru Fungsi validator: fungsi yang digunakan untuk memastikan bahwa nilai yang diinputkan pada komponen tipe data valid sesuai logika yang dibuat. Fungsi manipulasi: fungsi untuk melakukan berbagai macam memanipulasi tipe data yang telah dibuat. Berikut adalah dua contoh fungsi konstruktor yang digunakan untuk membuat tipe data time dengan menggunakan dua alternatif cara: 1234567891011121314151617181920212223242526time make_time(int j, int m, int d)&#123; time waktu; waktu.j = j; waktu.m = m; waktu.d = d; return waktu;&#125;time seconds_2_time(int seconds)&#123; time waktu; waktu.jam = seconds / 3600; waktu.menit = (seconds % 3600) / 60; waktu.detik = seconds % 60; return time;&#125;int main()&#123; time new_time1 = make_time(5, 30, 25); time new_time2 = seconds_2_time(3755); return 0;&#125; Fungsi make_time adalah contoh fungsi konstruktor paling sederhana, di mana fungsi tersebut hanya menerima inputan untuk komponen struktur melalui parameter dengan jumlah yang sama persis dengan komponen struktur dan tidak melakukan validasi apapun. Meskipun fungsi tersebut sangat sederhana, tapi dengan menggunakan fungsi konstruktor tersebut minimal kita dapat menghemat waktu inisialisasi atau pengisian nilai pada tipe data waktu jika dibanding dengan cara manual mengisi komponen satu persatu. Sedangkan fungsi seconds_2_time juga adalah konstruktor untuk tipe data time. Fungsi ini menggunakan pendekatan yang berbeda yaitu dengan mengonversi nilai detik yang diberikan pada parameter dan merubahnya ke dalam tipe data waktu. Selanjutnya untuk contoh fungsi selektor diberikan pada koding di bawah ini: 1234567891011121314int get_hour(time waktu)&#123; return waktu.jam;&#125;int get_second(time waktu)&#123; return waktu.jam;&#125;int time_2_second(time waktu)&#123; return ((waktu.jam * 3600) + (waktu.menit * 60) + waktu.detik);&#125; Pada contoh yang diberikan di atas fungsi get_hour dan get_second merupakan contoh fungsi sederhana dari selector. Yang dilakukan kedua fungsi tersebut hanya mengembalikan nilai jam dan detik dalam satuan integer. Adapun fungsi time_2_second merupakan contoh pengembalian nilai tertentu dari tipe data waktu dalam bentuk khusus, yang dalam kasus ini mengembalikan jumlah detik dari satuan waktu yang diberikan pada parameter. Fungsi validator bertujuan untuk memastikan satuan waktu yang diinputkan sudah valid sesuai dengan logika yang diinginkan. Berikut ini adalah contoh fungsi validator beserta implementasinya dalam konstruktor: 123456789101112131415161718192021222324252627int valid_time(time waktu)&#123; return (((waktu.jam &gt;= 0) &amp;&amp; (waktu.jam &lt; 24)) &amp;&amp; ((waktu.menit &gt;= 0) &amp;&amp; (waktu.menit &lt; 60)) &amp;&amp; ((waktu.detik &gt;= 0) &amp;&amp; (waktu.detik) &lt; 60));&#125;// pengembangan fungsi konstruktor dengan validasitime make_time(int jam, int menit, int detik)&#123; time waktu; waktu.j = j; waktu.m = m; waktu.d = d; if(valid_time(waktu)) return waktu; else return make_time(0, 0, 0);&#125;int main()&#123; time waktu1 = make_time(5, 23, 50); // -&gt; 5:23:50 time waktu2 = make_time(20, 87, -9); // -&gt; 0:0:0 return 0;&#125; Terlihat pada koding di atas, fungsi valid_time melakukan validasi terhadap nilai waktu yang diberikan pada parameter dan mengembalikan nilai true atau false. Selanjutnya pada fungsi konstruktor make_time fungsi tersebut digunakan untuk mengecek apakah waktu yang diinputkan sudah valid atau tidak, jika tidak maka fungsi konstruktor akan mengembalikan waktu default yaitu 0:0:0. Kategori terakhir adalah fungsi manipulasi yang mengerjakan tugas selain ketiga kategorisasi sebelumnya. Berikut di bawah ini adalah beberapa contoh fungsi manipulasi waktu: 123456789101112131415161718void print_time(time waktu)&#123; printf(\"%d:%d:%d\", waktu.jam, waktu.menit, waktu.detik);&#125;time add_time(time waktu1, time waktu2)&#123; return second_2_time(time_2_second(waktu1) + time_2_second(waktu2));&#125;void print_times(time * time_data, int n)&#123; for(int i = 0; i &lt; n; i++) &#123; print_time(time_data[i]); printf(\"\\n\"); &#125;&#125; Ketiga fungsi di atas adalah contoh manipulasi tipe data time yang tidak berhubungan dengan konstruktor, selector, atau validator. Dua diantaranya add_time dan print_times memanfaatkan fungsi-fungsi operator yang pernah dibuat sebelumnya. Array dan Pointer of StructSeperti halnya tipe data lain, tipe data yang telah dibuat dapat digunakan untuk array dan pointer. Deklarasi maupun penggunaan array of struct tidak jauh berbeda dengan penggunaan tipe data biasa, begitu juga untuk pointer untuk keperluan dynamic array juga tidak jauh berbeda sebagaimana ditunjukkan pada contoh koding di bawah ini: 12345678910111213time data_waktu[10];data_waktu[0] = make_time(5, 12, 18);data_waktu[1] = make_time(19, 20, 00);print_time(data_waktu[0]);printf(\"Jam kedua adalah %d\\n\", data_waktu[1].jam);// deklarasi waktu untuk pointertime * p_waktu;// deklarasi array dinamis dengan mallocp_waktu = malloc(10 * sizeof p_waktu);p_waktu[0] = make_time(20, 15, 00);printf(\"Menit dari waktu adalah %d\\n\", p_waktu[0].menit); Contoh koding di atas menunjukkan bahwa deklarasi dan penggunaan array dan pointer of struct memang tidak terlalu berbeda dengan tipe data primitif, baik untuk penggunaan array statis maupun array dinamis dengan menggunakan perintah malloc. Meski demikian untuk pointer of struct yang digunakan untuk mengakses alamat memori dari variabel lain (indirect access) ada pengecualian pada cara pengaksesan elemennya yaitu menggunakan operator -&gt; (panah) bukan . (titik). Contoh pengaksesan tersebut dapat dilihat pada koding di bawah ini. 1234567891011121314time waktu = make_time(5, 12, 15);time * p_waktu = &amp;waktu;print_time(waktu); // --&gt; 5:12:15p_waktu-&gt;jam = 20;p_waktu-&gt;menit = 10;p_waktu-&gt;detik = 0;print_time(waktu); // --&gt; 20:10:0*p_waktu = make_time(10, 20, 30);print_time(waktu); // --&gt; 10:20:30 Struct Sebagai Elemen Struct LainSetelah mendeklarasikan sebuah struktur, maka struktur tersebut dapat digunakan sebagaimana tipe data lain, termasuk diantaranya adalah digunakan untuk membuat struktur baru. Di bawah ini diberikan contoh struct time yang sudah dideklarasikan sebelumnya digunakan pada struct schedule untuk membentuk tipe data baru lagi: 12345typedef struct schedule&#123; time start, finish; char *event;&#125;","tags":[{"name":"struct","slug":"struct","permalink":"http://labdaspro.github.io/tags/struct/"},{"name":"class","slug":"class","permalink":"http://labdaspro.github.io/tags/class/"},{"name":"abstract data type","slug":"abstract-data-type","permalink":"http://labdaspro.github.io/tags/abstract-data-type/"},{"name":"tipe data","slug":"tipe-data","permalink":"http://labdaspro.github.io/tags/tipe-data/"}]},{"title":"Fungsi","date":"2017-06-02T08:13:27.000Z","path":"2017/06/02/Fungsi/","text":"Fungsi merupakan suatu bagian program yang dimaksudkan untuk mengerjakan tugas tertentu dan letaknya terpisah dari program yang memanggilnya. Dalam setiap program dalam bahasa C, minimal terdapat satu buah fungsi yaitu fungsi main(). Berikut adalah contoh pembuatan fungsi dalam bahasa C. Kentungan dalam penggunaan fungsi meliputi: Program akan memiliki struktur yang jelas (mempunyai readability yang tinggi) Bersifat reusability (dapat digunakan kembali) sehingga akan menghindari penulisan program yang sama. Dalam bahasa C, fungsi dapat diklasifikasikan menjadi dua yaitu: Fungsi pustaka atau fungsi yang telah tersedia dalam Bahasa C. Fungsi yang didefinisikan atau dibuat oleh programmer. Cara membuat fungsi sendiri dalam bahasa C adalah sebagai berikut: Sebelum digunakan (dipanggil), suatu fungsi harus dideklarasikan dan didefinisikan terlebih dahulu.Bentuk umum pendeklarasian fungsi adalah : 1tipe_fungsi nama_fungsi(parameter_fungsi); Sedangkan bentuk umum pendefinisian fungsi adalah : 1234567tipe_fungsi nama_fungsi(parameter_fungsi)&#123; statement statement ………... ………...&#125; 12345void print_array(int * data, int n)&#123; for(int i = 0; i &lt; n; i++) printf(\"%d\", data[i]);&#125;","tags":[{"name":"fungsi","slug":"fungsi","permalink":"http://labdaspro.github.io/tags/fungsi/"}]},{"title":"Hello World","date":"2017-06-02T07:10:28.000Z","path":"2017/06/02/hello-world/","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","tags":[]}]